#!/bin/sh

update
upgrade

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'caskroom/versions'
tap 'homebrew/brewdler'
tap 'kopischke/ctags'
tap 'neovim/neovim'
tap 'homebrew/bundle'
tap 'homebrew/dev-tools'
tap 'homebrew/services'
tap 'choppsv1/term24'

brew 'coreutils'
brew 'moreutils'
brew 'findutils'

brew 'ack'
brew 'ansifilter'
brew 'aspell', args: ['--with-lang-en']
brew 'bash'
brew 'bash-completion'
brew 'homebrew/versions/bash-completion2'
brew 'bash-git-prompt'
brew 'bash-preexec'
brew 'chruby'
brew 'cmake'
brew 'dbus'
brew 'diff-so-fancy'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'elasticsearch'
brew 'choppsv1/term24/emacs-mac'
# brew 'emacs', args: ['--devel', '--with-imagemagick', '--with-gnutls', '--with-librsvg']
# brew services start emacs
brew 'extract_url'
brew 'ffind'
brew 'figlet'
brew 'fzf'
brew 'gettext'
brew 'gist'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'gnutls'
brew 'grc'
brew 'heroku-toolbelt'
brew 'homebrew/dupes/grep'
brew 'htop-osx'
brew 'hub'
brew 'imagemagick'
brew 'httpie'
brew 'homebrew/versions/mysql'
brew 'libgcrypt'
brew 'mas'
brew 'homebrew/versions/mysql56'
brew 'ncdu'
brew 'neovim', args: ['--HEAD', 'with-lua', 'with-perl', 'with-ruby']
brew 'openssl'
brew 'phantomjs'
brew 'p7zip'
brew 'perl'
brew 'pgcli'
brew 'pkg-config'
brew 'postgresql'
brew 'python'
brew 'python3'
brew 'rabbitmq'
brew 'readline'
brew 'reattach-to-user-namespace', args: ['wrap-pbcopy-and-pbpaste']
brew 'redis'
brew 'ripgrep'
brew 'ruby-install'
brew 'ssh-copy-id'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmate'
brew 'tmux', args: ['--with-utf8proc']
brew 'tree'
brew 'urlview'
brew 'weechat', args: ['--with-ruby', '--with-python', '--with-perl', '--with-lua', '--with-aspell', '--with-javascript', '--with-curl', '--with-guile', '--HEAD']
brew 'wget', args: ['enable-iri']
brew 'vim', args: ['--with-lua', '--with-luajit', '--with-python3']
brew 'zsh', args: ['--with-unicode9', '--without-etcdir']
brew 'zsh-completions'
brew 'zsh-lovers'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask '1password'
cask 'alfred'
cask 'alternote'
cask 'bartender2'
cask 'bettertouchtool'
# cask 'caskroom/fonts/font-hack'
# cask 'caskroom/fonts/font-input'
cask 'caskroom/fonts/font-source-code-pro'
cask 'cloak'
cask 'contexts'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'hazel'
cask 'hammerspoon'
cask 'hyperterm'
cask 'istat-menus'
cask 'iterm2-nightly'
cask 'java'
cask 'karabiner'
cask 'keycastr'
cask 'licecap'
cask 'parallels-desktop'
cask 'sequel-pro'
cask 'screenhero'
cask 'seil'
cask 'shiori'
cask 'slack'
cask 'skype'
cask 'spotify'
cask 'the-unarchiver'
cask 'totalfinder'
cask 'usb-overdrive'
cask 'virtualbox'
cask 'yubiswitch'

cleanup

