#!/bin/sh

update
upgrade

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/versions'
tap 'homebrew/brewdler'
tap 'homebrew/bundle'
tap 'homebrew/dev-tools'
tap 'homebrew/services'
tap 'kopischke/ctags'
tap 'choppsv1/term24'
tap 'neovim/neovim'
tap 'caius/jo'
tap 'simeji/jid'


brew 'ansifilter'
brew 'autoconf'
brew 'automake'
brew 'aspell', args: ['--with-lang-en']
brew 'chruby'
brew 'cmake'
brew 'coreutils'
brew 'dbus'
brew 'diff-so-fancy'
brew 'docker'
brew 'docker-compose'
brew 'docker-machine'
brew 'docker-completion'
brew 'choppsv1/term24/emacs-mac', args: ['--with-dbus', '--with-modules', '--with-xml2', '--with-ctags', '--with-spacemacs-icon']
brew 'emacs', args: ['--with-imagemagick', '--with-gnutls', '--with-librsvg', '--with-ctags', '--with-mailutils', '--with-dbus']
brew 'extract_url'
brew 'ffind'
brew 'figlet'
brew 'findutils'
brew 'fzf'
brew 'gawk'
brew 'gettext'
brew 'gist'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'gnutls'
brew 'grc'
brew 'gnupg21'
brew 'gcc49'
brew 'heroku-toolbelt'
brew 'homebrew/dupes/grep'
brew 'htop-osx'
brew 'hub'
brew 'imagemagick'
brew 'httpie'
brew 'jid'
brew 'jo'
brew 'jq'
brew 'libgcrypt'
brew 'libtool'
brew 'libyaml'
brew 'libxslt'
brew 'mas'
brew 'mysql'
brew 'ncdu'
brew 'ncurses'
brew 'moreutils'
brew 'neovim', args: ['with-lua', 'with-perl', 'with-ruby']
brew 'npm'
brew 'openssl'
brew 'phantomjs'
brew 'p7zip'
brew 'perl'
brew 'pgcli'
brew 'pkg-config'
brew 'postgresql'
brew 'python'
brew 'python3'
brew 'rabbitmq'
brew 'readline'
brew 'reattach-to-user-namespace', args: ['wrap-pbcopy-and-pbpaste']
brew 'redis'
brew 'ripgrep'
brew 'ruby-build'
brew 'ruby-install'
brew 'ssh-copy-id'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmate'
brew 'tmux', args: ['--with-utf8proc']
brew 'tree'
brew 'unixodbc'
brew 'urlview'
brew 'weechat', args: ['--with-ruby', '--with-python', '--with-perl', '--with-lua', '--with-aspell', '--with-javascript', '--with-curl', '--with-guile']
brew 'wget', args: ['enable-iri']
brew 'wifi-password'
# brew 'vim', args: ['--with-lua', '--with-luajit', '--with-python3', '--with-tcl', '--with-override-system-vi']
brew 'yarn'
brew 'zsh', args: ['--with-unicode9', '--without-etcdir']
brew 'zsh-completions'
brew 'zsh-lovers'
brew 'zsh-autosuggestions'
brew 'zsh-syntax-highlighting'

cask '1password'
cask 'alfred'
cask 'alternote'
cask 'bartender2'
cask 'betterzipql'
cask 'font-source-code-pro'
cask 'font-fira-code'
cask 'cloak'
cask 'contexts'
cask 'dropbox'
cask 'flux'
cask 'google-chrome'
cask 'graphiql'
cask 'hazel'
cask 'hammerspoon'
cask 'hyper'
cask 'istat-menus'
cask 'iterm2-nightly'
cask 'java'
cask 'karabiner-elements'
cask 'parallels-desktop'
cask 'qlcolorcode'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'screenhero'
cask 'sequel-pro'
cask 'seil'
cask 'shiori'
cask 'slack'
cask 'skype'
cask 'spotify'
cask 'the-unarchiver'
cask 'totalfinder'
cask 'usb-overdrive'
cask 'virtualbox'

# mas '1Blocker', id: 1107421413
# mas 'Deliveries', id: 924726344
# mas 'GIPHY CAPTURE', id: 668208984
# mas 'Reeder 3', id: 880001334
# mas 'Shush', id: 496437906
# mas 'Sip', id: 507257563
# mas 'Sketch', id: 852320343
mas 'Tweetbot', id: 557168941

system "ln -s /usr/local/bin/gcc-4.9 /usr/local/bin/gcc"
# system "/usr/local/opt/fzf/install"
# system "echo /usr/local/bin/bash >> /etc/shells"
# system "chsh -s /usr/local/bin/bash"

linkapps
cleanup

