#!/bin/sh

cask_args appdir: '/Applications'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'caskroom/versions'
tap 'choppsv1/term24'
tap 'homebrew/brewdler'
tap 'kopischke/ctags'
tap 'Goles/battery'
tap 'neovim/homebrew-neovim'
tap 'homebrew/bundle'
tap 'homebrew/dev-tools'
tap 'homebrew/services'
tap 'rogual/neovim-dot-app'

brew 'coreutils'
brew 'moreutils'
brew 'findutils'

brew 'ack'
brew 'bash'
brew 'bash-completion'
brew 'homebrew/versions/bash-completion2'
brew 'bash-git-prompt'
brew 'bash-preexec'
brew 'choppsv1/term24/tmux'
# brew 'tmux', args: ['--HEAD']
brew 'chruby'
brew 'dbus'
brew 'diff-so-fancy'
brew 'erlang'
brew 'elasticsearch'
brew 'extract_url'
brew 'ffind'
brew 'figlet'
brew 'fzf'
brew 'gist'
brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'grc'
brew 'heroku-toolbelt'
brew 'homebrew/dupes/grep'
brew 'htop-osx'
brew 'hub'
brew 'imagemagick'
brew 'imagesnap'
brew 'httpie'
brew 'homebrew/binary/kwm'
brew 'mysql'
brew 'ncdu'
brew 'neovim', args: ['--HEAD', 'with-lua', 'with-perl', 'with-ruby']
brew 'neovim-dot-app'
brew 'openssl'
brew 'phantomjs'
brew 'p7zip'
brew 'postgresql'
brew 'python'
brew 'python3'
brew 'rabbitmq'
brew 'reattach-to-user-namespace', args: ['wrap-pbcopy-and-pbpaste']
brew 'redis'
brew 'ruby-install'
brew 'ssh-copy-id'
brew 'terminal-notifier'
brew 'the_silver_searcher'
brew 'tig'
brew 'tmate'
brew 'TomAnthony/brews/itermocil'
brew 'urlview'
brew 'tree'
brew 'weechat', args: ['with-ruby', 'with-python', 'with-perl', 'with-lua', 'with-aspell', 'with-javascript', 'with-curl', 'with-guile']
brew 'wget', args: ['enable-iri']
brew 'zsh'
brew 'zsh-completions'
brew 'zsh-lovers'
brew 'zsh-syntax-highlighting'

cask '1password'
cask 'alfred'
cask 'alternote'
cask 'bartender'
cask 'bettertouchtool'
cask 'caskroom/fonts/font-hack'
cask 'caskroom/fonts/font-input'
cask 'caskroom/fonts/font-source-code-pro'
cask 'cloak'
cask 'contexts'
cask 'dropbox'
cask 'firefox'
cask 'flux'
cask 'google-chrome'
cask 'hazel'
cask 'hammerspoon'
cask 'istat-menus'
cask 'iterm2-nightly'
cask 'java'
cask 'karabiner'
cask 'keycastr'
cask 'licecap'
cask 'parallels-desktop'
cask 'radiant-player'
cask 'sequel-pro'
cask 'screenhero'
cask 'seil'
cask 'shiori'
cask 'slack'
cask 'the-unarchiver'
cask 'totalfinder'
cask 'usb-overdrive'
cask 'virtualbox'
cask 'yubiswitch'

linkapps 'neovim-dot-app'
# install manually:
# Google Play Music Desktop Player
